import json


def get_messages_by_chat_id(chat_id):  # TODO change hardcoded return object to service call
    return json.loads("""
    {
    "chat_id": 211057,
    "chat": [
      {
        "uid": 1533049,
        "time": "22:56:45",
        "msg": " Здравствуйте!"
      },
      {
        "uid": 1,
        "time": "22:57:03",
        "msg": " Здравствуйте!"
      },
      {
        "uid": 1,
        "time": "22:57:27",
        "msg": " Готов ответить на Ваши вопросы."
      },
      {
        "uid": 1533049,
        "time": "22:57:51",
        "msg": " Пришла выписка по счету. Мне получается эту сумму надо оплатить до 1 го мая?"
      },
      {
        "uid": 1,
        "time": "22:58:10",
        "msg": " Чтобы воспользоваться беспроцентным периодом?"
      },
      {
        "uid": 1533049,
        "time": "22:58:22",
        "msg": " 11, 111? Ага"
      },
      {
        "uid": 1,
        "time": "22:58:50",
        "msg": " Вам необходимо оплатить 11111.11 руб. до 11.11"
      },
      {
        "uid": 1533049,
        "time": "22:59:45",
        "msg": " Все. Понятно. Спасибо"
      },
      {
        "uid": 1,
        "time": "22:59:50",
        "msg": " Всего доброго! До свидания!"
      }
    ]
  }""")
